flatpak.org
#+TITLE: Flatpak Loom: Literate & Reproducible
#+DESCRIPTION: Flatpak manifest, bridges, permissions
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Purpose
Reproducible Flatpak state from your dotfiles, Guix style. Repo-backed Flatpaks and GitHub-release Flatpak bundles are both owned here. =loom flatpak:apply= is the single authority for Flatpak install, update, and uninstall decisions.

* Flatpak single manifest
Columns: ORIGIN, ID, BRANCH, SCOPE. Comments and blanks allowed.
#+BEGIN_SRC text :tangle linux/.flatpak/manifest/apps.ssv
# origin id branch scope
flathub com.github.tchx84.Flatseal stable user
flathub app.zen_browser.zen stable user
flathub cc.arduino.IDE2	stable user
flathub com.discordapp.Discord stable user
flathub com.github.qarmin.czkawka stable user
flathub com.leinardi.gwe stable user
flathub com.logseq.Logseq stable user
flathub com.rustdesk.RustDesk stable user
flathub com.vscodium.codium stable user
flathub io.github.qwersyk.Newelle stable user
flathub io.github.ungoogled_software.ungoogled_chromium	stable user
flathub io.github.webcamoid.Webcamoid stable user
flathub md.obsidian.Obsidian stable user
flathub net.davidotek.pupgui2 stable user
flathub net.rpcs3.RPCS3	stable user
flathub one.ablaze.floorp stable user
flathub org.duckstation.DuckStation stable user
flathub org.freac.freac stable user
flathub org.jdownloader.JDownloader stable user
flathub org.keepassxc.KeePassXC stable user
flathub org.ppsspp.PPSSPP stable user
flathub org.telegram.desktop stable user
flathub org.upscayl.Upscayl stable user
flathub us.zoom.Zoom stable user
flathub de.leopoldluley.Clapgrep stable user
flathub io.github.josephmawa.Bella stable user
flathub org.zotero.Zotero stable user
flathub net.xmind.XMind stable user
flathub io.github.sithlord48.blackchocobo stable user
flathub com.github.Flacon stable user
flathub org.garudalinux.firedragon stable user
flathub io.github.flattool.Warehouse stable user
# flathub com.github.marktext.marktext stable user
flathub me.mitya57.ReText stable user
# flathub org.kde.ghostwriter stable user
flathub io.github.dgsasha.Remembrance stable user
flathub org.musicbrainz.Picard stable user
flathub io.mgba.mGBA stable user
flathub org.wezfurlong.wezterm stable user
flathub	org.freedesktop.Sdk 23.08 user
flathub net.pcsx2.PCSX2 stable user
flathub eu.betterbird.Betterbird stable user
flathub org.atheme.audacious stable user
flathub com.moonlight_stream.Moonlight stable user
#+END_SRC

* Flatpak release bundle manifest
For Flatpak apps distributed as GitHub release bundles rather than OSTree remotes.
Columns: REPO, ID, ASSET_NAME_OR_GLOB, SCOPE.
#+BEGIN_SRC text :tangle linux/.flatpak/manifest/releases.ssv
# repo id asset_name_or_glob scope
Elleo/pied com.mikeasoft.pied com.mikeasoft.pied.flatpak user
#+END_SRC

* Remotes setup
Idempotent helper to ensure real Flatpak remotes exist before applying the manifest. GitHub release bundles are handled by dedicated Flatpak release helpers below, not as remotes.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-remotes-setup :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

unset_ssl() { unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

add_remote() {
  local scope="$1" name="$2" url="$3"
  unset_ssl
  if [ "$scope" = "system" ]; then
    if flatpak remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists --from "$name" "$f"
    fi
  else
    if flatpak --user remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists --from "$name" "$f"
    fi
  fi
}

# Flathub for both scopes
add_remote system flathub https://dl.flathub.org/repo/flathub.flatpakrepo
add_remote user   flathub https://dl.flathub.org/repo/flathub.flatpakrepo
#+END_SRC

* Make targets
Include directly with =make -f all/.mk/flatpak.mk <target>= or add to your main Makefile with =-include all/.mk/flatpak.mk=.
#+BEGIN_SRC makefile :tangle all/.mk/flatpak.mk :padline no :comments none
# Flatpak Make targets fragment. Requires GNU Make 3.82+.
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: flatpak-remotes flatpak-capture flatpak-diff flatpak-release-diff flatpak-release-sync flatpak-sync flatpak-apply flatpak-perms-capture flatpak-perms-apply flatpak-bridge flatpak-bridge-reset

flatpak-remotes:
| @chmod +x $(HOME)/.local/bin/flatpak-remotes-setup 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-remotes-setup

flatpak-capture:
| @chmod +x $(HOME)/.local/bin/flatpak-capture 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-capture

flatpak-diff:
| @chmod +x $(HOME)/.local/bin/flatpak-diff 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-diff

flatpak-release-diff:
| @chmod +x $(HOME)/.local/bin/flatpak-release-diff 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-release-diff

flatpak-release-sync:
| @chmod +x $(HOME)/.local/bin/flatpak-release-sync 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-release-sync

# Additive only: installs + updates, no removals
flatpak-sync: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| ENFORCE=-1 UNINSTALL=-1 $(HOME)/.local/bin/flatpak-apply

# Default apply: enforce installs+updates; removals must be explicit (UNINSTALL=1)
flatpak-apply: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-apply

flatpak-perms-capture:
| @chmod +x $(HOME)/.local/bin/flatpak-perms-capture 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-perms-capture

flatpak-perms-apply:
| @chmod +x $(HOME)/.local/bin/flatpak-perms-apply 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-perms-apply

flatpak-bridge:
| @chmod +x $(HOME)/.local/bin/flatpak-desktop-bridge 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-desktop-bridge
| @chmod +x $(HOME)/.local/bin/flatpak-betterbird-profile-bridge 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-betterbird-profile-bridge || echo "⚠ betterbird bridge skipped"
| @chmod +x $(HOME)/.local/bin/flatpak-pcsx2-config-bridge 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-pcsx2-config-bridge || echo "⚠ pcsx2 bridge skipped"
| @chmod +x $(HOME)/.local/bin/flatpak-ungoogled-chromium-profile-bridge 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-ungoogled-chromium-profile-bridge || echo "⚠ chromium bridge skipped"

flatpak-bridge-reset:
| @chmod +x $(HOME)/.local/bin/flatpak-desktop-bridge-reset 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-desktop-bridge-reset
#+END_SRC

* Capture live state into the manifest
Merges your current user and system apps into =apps.ssv=. Keeps comments. Does not remove existing lines.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-capture :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail
OUT="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"

# Run flatpak in a clean env to avoid SSL/Guix contamination
CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

dump_scope() { # user|system
  local scope="$1"
  if [ "$scope" = user ]; then
    "${CLEAN_ENV[@]}" flatpak --user list --app --columns=origin,application,branch
  else
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=origin,application,branch
  fi | awk -v s="$scope" '
    NF>=3 { printf "%s %s %s %s\n", $1, $2, $3, s }
  '
}

tmp="$(mktemp)"; trap 'rm -f "$tmp"' EXIT

{
  # keep comments / blanks
  [ -f "$OUT" ] && grep -E '^\s*#|^\s*$' "$OUT" || true
  # merge existing data + fresh dumps, uniq
  {
    [ -f "$OUT" ] && grep -Ev '^\s*#|^\s*$' "$OUT" || true
    dump_scope user
    dump_scope system
  } | awk 'NF>=4 {print $1, $2, $3, $4}' | sort -u
} > "$tmp"

mv "$tmp" "$OUT"
echo "Wrote $OUT"
#+END_SRC

* Diff plan
Shows what would be installed and what would be removed to match the manifest.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail
MAN="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"
REL_MAN="${HOME}/DotCortex/linux/.flatpak/manifest/releases.ssv"
REL_DIFF_HELPER="${HOME}/.local/bin/flatpak-release-diff"
[ -x "$REL_DIFF_HELPER" ] || REL_DIFF_HELPER="${HOME}/DotCortex/linux/.local/bin/flatpak-release-diff"

desired_repo_ids(){ awk '$0!~/^#/ && NF>=4{print $2, $4}' "$MAN" | sort -u; }
desired_release_ids(){ [ -f "$REL_MAN" ] && awk '$0!~/^#/ && NF>=4{print $2, $4}' "$REL_MAN" | sort -u || true; }
desired_ids(){ { desired_repo_ids; desired_release_ids; } | sort -u; }
installed_ids(){
  { flatpak --user list --app --columns=application | awk 'NF{print $1, "user"}'
    flatpak --system list --app --columns=application | awk 'NF{print $1, "system"}'; } \
 \
  | sort -u
}

d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' EXIT
desired_ids >"$d"; installed_ids >"$i"

# desired minus installed -> to install
echo "[plan] to install:"
join -v1 <(cut -d' ' -f1 "$d") <(cut -d' ' -f1 "$i") \
  | while read -r id; do grep -F "$id" "$d" | sed 's/^/  + /'; done || true

# installed minus desired -> to uninstall
echo "[plan] to uninstall:"
join -v1 <(cut -d' ' -f1 "$i") <(cut -d' ' -f1 "$d") \
  | while read -r id; do grep -F "$id" "$i" | sed 's/^/  - /'; done || true

if [ -x "$REL_DIFF_HELPER" ]; then
  "$REL_DIFF_HELPER" || true
fi
#+END_SRC

