linux/.local/bin/flatpak-diff
#!/usr/bin/env bash
# Diff plan
# Shows what would be installed and what would be removed to match the manifest.

# [[file:../../../flatpak.org::*Diff plan][Diff plan:1]]
set -euo pipefail
MAN="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"
REL_MAN="${HOME}/DotCortex/linux/.flatpak/manifest/releases.ssv"
REL_DIFF_HELPER="${HOME}/.local/bin/flatpak-release-diff"
[ -x "$REL_DIFF_HELPER" ] || REL_DIFF_HELPER="${HOME}/DotCortex/linux/.local/bin/flatpak-release-diff"

desired_repo_ids(){ awk '$0!~/^#/ && NF>=4{print $2, $4}' "$MAN" | sort -u; }
desired_release_ids(){ [ -f "$REL_MAN" ] && awk '$0!~/^#/ && NF>=4{print $2, $4}' "$REL_MAN" | sort -u || true; }
desired_ids(){ { desired_repo_ids; desired_release_ids; } | sort -u; }
installed_ids(){
  { flatpak --user list --app --columns=application | awk 'NF{print $1, "user"}'
    flatpak --system list --app --columns=application | awk 'NF{print $1, "system"}'; } \
 \
  | sort -u
}

d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' EXIT
desired_ids >"$d"; installed_ids >"$i"

# desired minus installed -> to install
echo "[plan] to install:"
join -v1 <(cut -d' ' -f1 "$d") <(cut -d' ' -f1 "$i") \
  | while read -r id; do grep -F "$id" "$d" | sed 's/^/  + /'; done || true

# installed minus desired -> to uninstall
echo "[plan] to uninstall:"
join -v1 <(cut -d' ' -f1 "$i") <(cut -d' ' -f1 "$d") \
  | while read -r id; do grep -F "$id" "$i" | sed 's/^/  - /'; done || true

if [ -x "$REL_DIFF_HELPER" ]; then
  "$REL_DIFF_HELPER" || true
fi
# Diff plan:1 ends here
