linux/.local/bin/flatpak-remotes-setup
#!/usr/bin/env bash
# Remotes setup
# Idempotent helper to ensure real Flatpak remotes exist before applying the manifest. GitHub release bundles are handled by dedicated Flatpak release helpers below, not as remotes.

# [[file:../../../flatpak.org::*Remotes setup][Remotes setup:1]]
#!/usr/bin/env bash
set -euo pipefail

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

unset_ssl() { unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

add_remote() {
  local scope="$1" name="$2" url="$3"
  unset_ssl
  if [ "$scope" = "system" ]; then
    if flatpak remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists --from "$name" "$f"
    fi
  else
    if flatpak --user remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists --from "$name" "$f"
    fi
  fi
}

# Flathub for both scopes
add_remote system flathub https://dl.flathub.org/repo/flathub.flatpakrepo
add_remote user   flathub https://dl.flathub.org/repo/flathub.flatpakrepo
# Remotes setup:1 ends here
