linux/.local/bin/flatpak-release-sync
#!/usr/bin/env bash
# GitHub release-backed Flatpak bundles
# These helpers keep Flatpak bundles cached under =${XDG_CACHE_HOME:-$HOME/.cache}/flatpak/releases= and install them through Flatpak, while still letting =loom flatpak:apply= own the full desired state.


# [[file:../../../flatpak.org::*GitHub release-backed Flatpak bundles][GitHub release-backed Flatpak bundles:1]]
#!/usr/bin/env bash
set -euo pipefail

REL_MAN="${HOME}/DotCortex/linux/.flatpak/manifest/releases.ssv"
CACHE_BASE="${XDG_CACHE_HOME:-$HOME/.cache}/flatpak/releases"
FORCE_SUDO_SYSTEM="${FORCE_SUDO_SYSTEM:-0}"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin:${HOME}/.local/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}"
  TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

[ -f "$REL_MAN" ] || exit 0

gh_latest_json() {
  local repo="$1" url="https://api.github.com/repos/${repo}/releases/latest"
  if [ -n "${GH_TOKEN:-}" ]; then
    curl -fsSL -H "Authorization: Bearer $GH_TOKEN" "$url"
  else
    curl -fsSL "$url"
  fi
}

cache_dir() {
  local app_id="$1"
  printf '%s/%s\n' "$CACHE_BASE" "$app_id"
}

installed_version() {
  local app_id="$1" scope="$2"
  if [ "$scope" = user ]; then
    { "${CLEAN_ENV[@]}" flatpak --user info "$app_id" 2>/dev/null | awk -F': *' '/^[[:space:]]*Version:/ {print $2}'; } || true
  else
    { "${CLEAN_ENV[@]}" flatpak --system info "$app_id" 2>/dev/null | awk -F': *' '/^[[:space:]]*Version:/ {print $2}'; } || true
  fi
}

run_install() {
  local scope="$1" bundle="$2"
  if [ "$scope" = system ] && [ "$FORCE_SUDO_SYSTEM" = 1 ]; then
    sudo "${CLEAN_ENV[@]}" flatpak install -y --or-update --system --bundle "$bundle"
    return 0
  fi
  if [ "$scope" = user ]; then
    "${CLEAN_ENV[@]}" flatpak install -y --or-update --user --bundle "$bundle"
  else
    if ! "${CLEAN_ENV[@]}" flatpak install -y --or-update --system --bundle "$bundle"; then
      echo "Retrying with sudo: flatpak install --or-update --system --bundle $bundle" >&2
      sudo "${CLEAN_ENV[@]}" flatpak install -y --or-update --system --bundle "$bundle"
    fi
  fi
}

sync_one() {
  local repo="$1" app_id="$2" asset_name="$3" scope="$4"
  local json latest_tag latest_ver asset_url asset_digest dir bundle old_name installed tmp resolved_asset_name asset_entry_name asset_entry_url asset_entry_digest

  json="$(gh_latest_json "$repo")"
  latest_tag="$(jq -r '.tag_name' <<<"$json")"
  latest_ver="$(sed -E 's/^v//' <<<"$latest_tag")"
  while IFS=$'\t' read -r asset_entry_name asset_entry_url asset_entry_digest; do
    case "$asset_entry_name" in
      $asset_name)
        resolved_asset_name="$asset_entry_name"
        asset_url="$asset_entry_url"
        asset_digest="$asset_entry_digest"
        break
        ;;
    esac
  done < <(jq -r '.assets[] | [.name, .browser_download_url, (.digest // "")] | @tsv' <<<"$json")

  [ -n "${asset_url:-}" ] || { echo "No asset matching $asset_name for $repo" >&2; return 1; }

  dir="$(cache_dir "$app_id")"
  mkdir -p "$dir"
  bundle="$dir/$resolved_asset_name"
  old_name="$( [ -f "$dir/asset.name" ] && cat "$dir/asset.name" || true )"
  if [ -n "$old_name" ] && [ "$old_name" != "$resolved_asset_name" ] && [ -f "$dir/$old_name" ]; then
    rm -f "$dir/$old_name"
  fi

  if [ ! -s "$bundle" ] || [ "$( [ -f "$dir/asset.digest" ] && cat "$dir/asset.digest" || true )" != "$asset_digest" ]; then
    tmp="$bundle.part"
    curl -fL "$asset_url" -o "$tmp"
    mv -f "$tmp" "$bundle"
  fi

  printf '%s\n' "$json" > "$dir/latest.json"
  printf '%s\n' "$latest_tag" > "$dir/tag"
  printf '%s\n' "$resolved_asset_name" > "$dir/asset.name"
  printf '%s\n' "$asset_url" > "$dir/asset.url"
  printf '%s\n' "$asset_digest" > "$dir/asset.digest"

  installed="$(installed_version "$app_id" "$scope")"
  echo "  release: repo=$repo id=$app_id scope=$scope latest=$latest_ver installed=${installed:-none}"
  if [ -n "$installed" ] && [ "$installed" = "$latest_ver" ]; then
    echo "  -> already current, skipping bundle reinstall for $app_id"
    return 0
  fi
  run_install "$scope" "$bundle"
}

echo "== Syncing release-backed Flatpaks =="
awk '$0!~/^#/ && NF>=4 {print $1 "\t" $2 "\t" $3 "\t" $4}' "$REL_MAN" \
  | while IFS=$'\t' read -r repo app_id asset_name scope; do
      sync_one "$repo" "$app_id" "$asset_name" "$scope"
    done
# GitHub release-backed Flatpak bundles:1 ends here
