flatpak.org
* Apply manifest with safe elevation
Default behavior: **enforce exact state** (install + update + uninstall).
System-scoped actions try Polkit first; if denied, retry the specific command with sudo.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-apply :shebang "#!/usr/bin/env bash"
# ~/.local/bin/flatpak-apply  (tangle this from flatpak.org)
#!/usr/bin/env bash
set -euo pipefail

MAN="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"
REL_MAN="${HOME}/DotCortex/linux/.flatpak/manifest/releases.ssv"
REL_SYNC_HELPER="${HOME}/.local/bin/flatpak-release-sync"
[ -x "$REL_SYNC_HELPER" ] || REL_SYNC_HELPER="${HOME}/DotCortex/linux/.local/bin/flatpak-release-sync"

# defaults: installs + updates; removals only if UNINSTALL=1
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-1}"
FORCE_SUDO_SYSTEM="${FORCE_SUDO_SYSTEM:-0}"
DEBUG="${DEBUG:-0}"

[ "$DEBUG" = 1 ] && set -x

# clean env
CLEAN_LANG="${LANG:-C.UTF-8}"
CLEAN_TERM="${TERM:-xterm-256color}"
CLEAN_PATH="/usr/sbin:/usr/bin:/bin:${HOME}/.local/bin"
CLEAN_ENV=(env -i HOME="$HOME" PATH="$CLEAN_PATH"
  LANG="$CLEAN_LANG" LC_ALL="$CLEAN_LANG"
  TERM="$CLEAN_TERM"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")
tab=$'\t'
FS='[[:space:]]+'
unset_ssl(){ unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

ensure_remotes(){
  local helper="$HOME/.local/bin/flatpak-remotes-setup"
  [ -x "$helper" ] && "${CLEAN_ENV[@]}" "$helper" || true
}

run_fp(){ local scope="$1"; shift; unset_ssl
  if [ "$scope" = system ] && [ "$FORCE_SUDO_SYSTEM" = 1 ]; then
    sudo "${CLEAN_ENV[@]}" flatpak "$@"; return
  fi
  if "${CLEAN_ENV[@]}" flatpak "$@"; then return; fi
  if [ "$scope" = system ]; then
    echo "Retrying with sudo: flatpak $*" >&2
    sudo "${CLEAN_ENV[@]}" flatpak "$@"
  fi
}

# ----- parsing & plan (normalize to TAB-delimited) -----
desired_pairs(){
  {
    awk -v FS="$FS" -v OFS="$tab" '$0!~/^#/ && NF>=4{print $2,$4}' "$MAN"
    [ -f "$REL_MAN" ] && awk -v FS="$FS" -v OFS="$tab" '$0!~/^#/ && NF>=4{print $2,$4}' "$REL_MAN" || true
  } | sort -u
}
installed_pairs(){
  { "${CLEAN_ENV[@]}" flatpak --user   list --app --columns=application | awk -v OFS="$tab" 'NF{print $1,"user"}'
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | awk -v OFS="$tab" 'NF{print $1,"system"}'; } \
  | sort -u
}

print_plan(){
  local d i; d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' RETURN
  desired_pairs >"$d"; installed_pairs >"$i"
  echo "== Plan =="
  echo "[to install]"
  join -v1 -t "$tab" <(cut -f1 "$d") <(cut -f1 "$i") | sed 's/^/  + /' || true
  echo "[to uninstall]"
  join -v1 -t "$tab" <(cut -f1 "$i") <(cut -f1 "$d") | sed 's/^/  - /' || true
}

already_installed(){ # id scope
  if [ "$2" = user ]; then "${CLEAN_ENV[@]}" flatpak --user   list --app --columns=application | grep -qx "$1"
  else                           "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | grep -qx "$1"
  fi
}

apply_installs(){
  echo "== Installing =="
  awk -v FS="$FS" '$0!~/^#/ && NF>=4{printf "  manifest: origin=%s id=%s branch=%s scope=%s\n",$1,$2,$3,$4}' "$MAN" || true

  awk -v FS="$FS" -v OFS="$tab" '$0!~/^#/ && NF>=4{print $1,$2,$3,$4}' "$MAN" |
  while read -r origin id branch scope; do
    [ -n "$origin$id$branch$scope" ] || continue
    already_installed "$id" "$scope" && continue
    echo "  -> installing $id ($scope) from $origin:$branch"
    args=(install -y); [ "$scope" = user ] && args+=(--user) || args+=(--system)
    run_fp "$scope" "${args[@]}" "$origin" "$id" "$branch"
  done
}

update_manifested(){
  [ "$UPDATE" = 1 ] || return 0
  echo "== Updating =="
  mapfile -t IDS_USER < <(awk -v FS="$FS" '$0!~/^#/ && NF>=4 && $4=="user"{print $2}' "$MAN" | sort -u)
  if [ "${#IDS_USER[@]}" -gt 0 ]; then
    "${CLEAN_ENV[@]}" flatpak --user update -y "${IDS_USER[@]}" || true
  fi

  mapfile -t IDS_SYS  < <(awk -v FS="$FS" '$0!~/^#/ && NF>=4 && $4=="system"{print $2}' "$MAN" | sort -u)
  if [ "${#IDS_SYS[@]}" -gt 0 ]; then
    run_fp system update -y "${IDS_SYS[@]}" || true
  fi

  if [ -x "$REL_SYNC_HELPER" ]; then
    FORCE_SUDO_SYSTEM="$FORCE_SUDO_SYSTEM" "$REL_SYNC_HELPER"
  fi
}

compute_extras(){ # installed-not-desired (id<TAB>scope)
  local d i; d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' RETURN
  desired_pairs >"$d"; installed_pairs >"$i"
  join -v2 -t "$tab" <(cut -f1 "$d") "$i" || true
}

apply_uninstalls(){
  [ "$ENFORCE" = 1 ] && [ "$UNINSTALL" = 1 ] || return 0
  echo "== Uninstalling extras =="
  compute_extras | while read -r id scope; do
    [ -n "${id:-}" ] || continue
    echo "  -> uninstalling $id ($scope)"
    if [ "$scope" = user ]; then
      "${CLEAN_ENV[@]}" flatpak --user uninstall -y "$id" || true
    else
      "${CLEAN_ENV[@]}" flatpak --system uninstall -y "$id" || true
    fi
  done
}

ensure_remotes
print_plan
apply_installs
update_manifested
apply_uninstalls
echo "Done."
#+END_SRC

** Flatpak env file
So Flatpak apps register with your desktop without hacks.
#+BEGIN_SRC conf :tangle linux/.config/environment.d/30-flatpak-exports.conf :mkdirp yes
XDG_DATA_DIRS=/usr/local/share:/usr/share:$HOME/.local/share/flatpak/exports/share:/var/lib/flatpak/exports/share
#+END_SRC

** Reproducible Flatpak permissions & overrides
Store exact per-app permissions from your machine and re-apply them anywhere.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-perms-capture :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
set -euo pipefail

BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"
mkdir -p "$BASE"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

awk '$0!~/^#/ && NF>=4 {print $2}' "$HOME/DotCortex/linux/.flatpak/manifest/apps.ssv" \
  | sort -u \
  | while read -r app; do
      out="$BASE/$app.perms"

      # Do not let a single failure kill the whole capture run
      if ! "${CLEAN_ENV[@]}" flatpak info --show-permissions "$app" >"$out" 2>/dev/null; then
        rm -f "$out"
        continue
      fi

      # Some apps may have no overrides at all, skip empty files
      if [ ! -s "$out" ]; then
        rm -f "$out"
        continue
      fi

      echo "wrote $out"
    done
#+END_SRC

** Apply script (maps the common fields → flatpak override)
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-perms-apply :shebang "#!/usr/bin/env bash" :mkdirp yes
set -euo pipefail
BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

apply_app(){
  local app="$1" f="$BASE/$1.perms"
  [ -f "$f" ] || { echo "skip $app (no $f)"; return 0; }

  # Build override flags from sections
  awk -v app="$app" '
    function splitcsv(s, arr){ gsub(/ /,"",s); n=split(s,arr,/[,;]/); return n }
    BEGIN{ sec=""; }
    /^\[/ { gsub(/[\[\]]/,""); sec=$0; next }
    /^[[:space:]]*$/ { next }
    { line=$0 }
    sec=="Context" {
      if (line ~ /^sockets=/) {
        sub(/^sockets=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--socket=%s\n", a[i];
      } else if (line ~ /^devices=/) {
        sub(/^devices=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--device=%s\n", a[i];
      } else if (line ~ /^filesystems=/) {
        sub(/^filesystems=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--filesystem=%s\n", a[i];
      } else if (line ~ /^persistent=/) {
        sub(/^persistent=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--persist=%s\n", a[i];
      } else if (line ~ /^features=/) {
        sub(/^features=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--enable-features=%s\n", a[i];
      } else if (line ~ /^shared=/) {
        sub(/^shared=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--share=%s\n", a[i];
      } else if (line ~ /^system-bus=/) {
        sub(/^system-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--system-talk-name=%s\n", a[i];
      } else if (line ~ /^session-bus=/) {
        sub(/^session-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--talk-name=%s\n", a[i];
      } else if (line ~ /^env=/) {
        sub(/^env=/,"",line); n=split(line,a,/[;,]/);
        for(i=1;i<=n;i++){ split(a[i],kv,/=/); if(kv[1]!="") printf "--env=%s=%s\n", kv[1], kv[2]; }
      }
    }
  ' "$f" | sed '/^$/d' > "/tmp/.fpflags.$app"

  # Apply at user scope
  if [ -s "/tmp/.fpflags.$app" ]; then
    mapfile -t FLAGS < "/tmp/.fpflags.$app"
    "${CLEAN_ENV[@]}" flatpak override --user "${FLAGS[@]}" "$app"
    echo "applied overrides → $app"
  else
    echo "no overrides to apply for $app"
  fi
  rm -f "/tmp/.fpflags.$app"
}

export -f apply_app
for p in "$BASE"/*.perms; do
  [ -e "$p" ] || { echo "no *.perms found in $BASE"; exit 0; }
  app="$(basename "$p" .perms)"
  apply_app "$app"
done
#+END_SRC

* Flatpak Bridge
** Flatpak ↔ Host fonts (conf.d)
#+BEGIN_SRC xml :tangle linux/.config/fontconfig/conf.d/50-run-host-font-dirs.conf
<?xml version='1.0'?>
<!DOCTYPE fontconfig SYSTEM 'urn:fontconfig:fonts.dtd'>
<fontconfig>
  <!-- User fonts via XDG (resolves to $HOME/.local/share/fonts in sandbox) -->
  <dir prefix="xdg">fonts</dir>
  <!-- Legacy per-user dir (harmless if absent) -->
  <dir>~/.fonts</dir>

  <!-- Host system fonts (via /run/host bridge) -->
  <dir>/run/host/usr/share/fonts</dir>
  <dir>/run/host/usr/local/share/fonts</dir>
</fontconfig>
#+END_SRC

** Flatpak global fontconfig (versioned in repo)
#+BEGIN_SRC xml :tangle linux/.flatpak/fontconfig/fonts.conf
<?xml version="1.0"?>
<!DOCTYPE fontconfig SYSTEM "urn:fontconfig:fonts.dtd">
<fontconfig>
  <!-- write caches inside the sandbox XDG cache -->
  <cachedir prefix="xdg">fontconfig</cachedir>

  <!-- user fonts inside sandbox -->
  <dir prefix="xdg">fonts</dir>
  <dir>~/.local/share/fonts</dir>

  <!-- host fonts via Flatpak bridge -->
  <dir>/run/host/usr/local/share/fonts</dir>
  <dir>/run/host/usr/share/fonts</dir>
</fontconfig>
#+END_SRC

