flatpak.org
** Flatpak desktop bridge — repo-first, idempotent (script)
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-desktop-bridge :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail

HOME_FC="$HOME/.flatpak/fontconfig/fonts.conf"   # ← stowed symlink target

# Validate (non-fatal if xmllint missing)
file -b --mime-encoding "$HOME_FC" >/dev/null 2>&1 || true
xmllint --noout "$HOME_FC" >/dev/null 2>&1 || true

# Allow caches (global or per-app later)
flatpak override --user --persist=".cache/fontconfig"

# Read-only bindings the sandboxes need
flatpak override --user \
  --filesystem="$HOME/.local/share/fonts:ro" \
  --filesystem="$HOME/.config/fontconfig:ro" \
  --filesystem="/run/host/usr/share/fonts:ro" \
  --filesystem="/run/host/usr/local/share/fonts:ro" \
  --filesystem="/run/host/etc/fonts:ro" \
  --filesystem="$HOME/.icons:ro" \
  --filesystem="$HOME/.local/share/icons:ro"

# Point fontconfig at the **HOME** path (stowed symlink)
flatpak override --user --env=FONTCONFIG_FILE="$HOME_FC"

# Cursor search path:
# - If XCURSOR_PATH is already set in the host env, extend it with /run/host
# - Otherwise, fall back to a sane default based on HOME + host icon dirs
if [ "${XCURSOR_PATH-}" != "" ]; then
  XCURSOR_PATH_VALUE="${XCURSOR_PATH}:/run/host/usr/local/share/icons:/run/host/usr/share/icons"
else
  XCURSOR_PATH_VALUE="$HOME/.icons:$HOME/.local/share/icons:/run/host/usr/local/share/icons:/run/host/usr/share/icons"
fi

flatpak override --user --env=XCURSOR_PATH="$XCURSOR_PATH_VALUE"

# Hygiene
flatpak override --user --unset-env=LD_PRELOAD

echo "✅ Flatpak bridge bound to HOME symlink:"
echo "   FONTCONFIG_FILE=$HOME_FC"
echo "   XCURSOR_PATH=$XCURSOR_PATH_VALUE"
#+END_SRC

** Flatpak desktop bridge — reset (optional)
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-desktop-bridge-reset :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail
# Reset app-specific overrides (keep global unless you also reset without args)
flatpak override --user --reset md.obsidian.Obsidian || true
flatpak override --user --reset one.ablaze.floorp   || true
# To nuke *all* user overrides, uncomment:
# flatpak override --user --reset
echo "🧹 Flatpak per-app overrides reset."
#+END_SRC

* Flatpak font cache refresher
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-fontcache-refresh :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail
apps=(
  org.garudalinux.firedragon
  one.ablaze.floorp
  org.wezfurlong.wezterm
)
for app in "${apps[@]}"; do
  echo ">> refreshing fontconfig cache inside $app"
  flatpak run --command=sh "$app" -lc \
    'fc-cache -fv $HOME/.local/share/fonts $HOME/.fonts /run/host/usr/local/share/fonts /run/host/usr/share/fonts'
done
echo "✅ done"
#+END_SRC

** Orchestrate (Elisp) — emit files and scripts (optional helper)
#+name: flatpak-bridge-orchestrate
#+BEGIN_SRC emacs-lisp :results silent
;; You can run this block to ensure the four blocks above have been tangled.
;; It does not replace tangling; it's a safety net if you want to call it directly.
(message "Flatpak bridge: use `make bridge-flatpak` or run tangle + stow + script.")
#+END_SRC

** VSCodium Flatpak host-bridge
#+name: codium-host
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-host :mkdirp yes :shebang "#!/usr/bin/env bash"
# ~/.local/bin/codium-host
#!/usr/bin/env bash
set -euo pipefail

APPID="com.vscodium.codium"

cfg_candidates=("$HOME/.config/VSCodium" "$HOME/.config/Code - OSS" "$HOME/.config/Code")
CONFIG_ROOT=""
for d in "${cfg_candidates[@]}"; do [ -d "$d" ] && CONFIG_ROOT="$d" && break; done
[ -n "$CONFIG_ROOT" ] || { echo "No config root found." >&2; exit 1; }

# Dynamic, no hardcoding. Allow override via env if you ever want it.
EXT_DIR="${VSCODE_EXTENSIONS_DIR:-$HOME/.vscode-oss/extensions}"

extra_flags=()
# Add X11 only if not already present in argv.json and not passed on CLI
argv_json="$CONFIG_ROOT/argv.json"
if [ ! -f "$argv_json" ] || ! grep -q '"ozone-platform"' "$argv_json"; then
  if ! printf '%s\n' "$@" | grep -q -- '--ozone-platform='; then
    extra_flags+=(--ozone-platform=x11)
  fi
fi

# Only clear LD_PRELOAD if it contains nocsd, otherwise leave your env alone
extra_env=(
  --env=PATH="$HOME/.guix-extra-profiles/core/core/bin:/usr/bin:/app/bin"
)
if [ "${LD_PRELOAD-}" != "" ] && printf '%s' "$LD_PRELOAD" | grep -q 'libgtk3-nocsd'; then
  extra_env+=(--env=LD_PRELOAD=)
fi

# Optional env scrubs if you ever see WebView crashes again. Leave commented unless needed.
# ENV_EXTRA=(
#   --env=GIO_MODULE_DIR=
#   --env=GIO_EXTRA_MODULES=
#   --env=GI_TYPELIB_PATH=
#   --env=LD_LIBRARY_PATH=
#   --env=GTK_PATH=
#   --env=GTK_IM_MODULE=
#   --env=QT_QPA_PLATFORMTHEME=
#   --env=QT_PLUGIN_PATH=
#   --env=QT_STYLE_OVERRIDE=
#   --env=XDG_DATA_DIRS=/usr/share:/app/share
#   --env=XDG_CONFIG_DIRS=/etc/xdg
# )

exec flatpak run \
  "${extra_env[@]}" \
  "$APPID" \
  --user-data-dir="$CONFIG_ROOT" \
  --extensions-dir="$EXT_DIR" \
  "${extra_flags[@]}" \
  "$@"
#+END_SRC

** Link Codium sandbox nvim -> repo nvim
#+name: codium-nvim-link
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-nvim-link :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APPID="com.vscodium.codium"
SBX_CFG="$HOME/.var/app/$APPID/config/nvim"
REPO_CFG="$HOME/DotCortex/all/.config/nvim"

if [ ! -d "$REPO_CFG" ]; then
  echo "Repo nvim not found: $REPO_CFG" >&2
  exit 1
fi

if [ -L "$SBX_CFG" ]; then
  # already a symlink
  tgt="$(readlink -f "$SBX_CFG")"
  if [ "$tgt" = "$REPO_CFG" ]; then
    echo "Already linked: $SBX_CFG -> $REPO_CFG"
    exit 0
  else
    echo "Different symlink at $SBX_CFG, refusing to overwrite." >&2
    exit 1
  fi
elif [ -e "$SBX_CFG" ]; then
  # real dir or file exists, back it up once
  ts=$(date +%Y%m%d-%H%M%S)
  echo "Backing up $SBX_CFG -> ${SBX_CFG}.bak.$ts"
  mv "$SBX_CFG" "${SBX_CFG}.bak.$ts"
fi

mkdir -p "$(dirname "$SBX_CFG")"
ln -sT "$REPO_CFG" "$SBX_CFG"
echo "Linked: $SBX_CFG -> $REPO_CFG"
#+END_SRC

** VSCodium: install LainCore theme (local extension)
#+name: codium-theme-bridge
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-theme-bridge :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

EXTROOT="$HOME/.vscode-oss/extensions"
PKG="metsatron.laincore-theme"
VER="0.0.1"
EXTDIR="$EXTROOT/$PKG-$VER"
THEMES="$EXTDIR/themes"

# Prefer repo source; fall back to the user path if needed.
SRC_REPO="$HOME/DotCortex/all/.config/VSCodium/User/laincore-theme.json"
SRC_USER="$HOME/.config/VSCodium/User/laincore-theme.json"
SRC=""
if [ -f "$SRC_REPO" ]; then SRC="$SRC_REPO"
elif [ -f "$SRC_USER" ]; then SRC="$SRC_USER"
else
  echo "Theme JSON not found at $SRC_REPO or $SRC_USER" >&2
  exit 1
fi

mkdir -p "$THEMES"

# Symlink into extension
ln -sfn "$SRC" "$THEMES/laincore-color-theme.json"

# Minimal package.json
cat > "$EXTDIR/package.json" <<'JSON'
{
  "name": "laincore-theme",
  "displayName": "LainCore",
  "publisher": "metsatron",
  "version": "0.0.1",
  "engines": { "vscode": "^1.60.0" },
  "categories": ["Themes"],
  "contributes": {
    "themes": [
      { "label": "LainCore", "uiTheme": "vs-dark", "path": "./themes/laincore-color-theme.json" }
    ]
  }
}
JSON

echo "LainCore theme extension ready at: $EXTDIR"
echo "→ JSON source: $SRC"
#+END_SRC

* Betterbird - reuse host Thunderbird profile
Use the host =~/.thunderbird= directly from the Betterbird Flatpak, without copying into =~/.var/app=.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-betterbird-profile-bridge :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

PROFILE_DIR="$HOME/.thunderbird"
APP_ID="eu.betterbird.Betterbird"

if [ ! -d "$PROFILE_DIR" ]; then
  echo "No $PROFILE_DIR found" >&2
  exit 1
fi

echo "Granting $APP_ID access to $PROFILE_DIR"
flatpak override --user --filesystem="$PROFILE_DIR" "$APP_ID"

echo "Clearing mesa_glthread for $APP_ID"
flatpak override --user --env=mesa_glthread= "$APP_ID"

echo "Done."
echo
echo "If this is your first time pointing Betterbird at this profile, run:"
echo
echo "  flatpak run eu.betterbird.Betterbird -P"
echo
echo "and pick the existing profile, then set it as default."
#+END_SRC

** PCSX2 Flatpak → host config bridge
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-pcsx2-config-bridge :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APP_ID="net.pcsx2.PCSX2"
HOST_CFG="$HOME/.config/PCSX2"
SANDBOX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SANDBOX_CFG="$SANDBOX_CFG_BASE/PCSX2"

echo "Granting $APP_ID access to $HOST_CFG"
flatpak override --user --filesystem="$HOST_CFG:create" "$APP_ID"

mkdir -p "$SANDBOX_CFG_BASE"

if [ -e "$SANDBOX_CFG" ] && [ ! -L "$SANDBOX_CFG" ]; then
  ts=$(date +%Y%m%d-%H%M%S)
  backup="${SANDBOX_CFG}.bak.$ts"
  echo "Existing sandbox config found, backing up:"
  echo "  $SANDBOX_CFG -> $backup"
  mv "$SANDBOX_CFG" "$backup"
fi

if [ ! -e "$SANDBOX_CFG" ]; then
  echo "Linking sandbox config to host config:"
  echo "  $SANDBOX_CFG -> $HOST_CFG"
  ln -s "$HOST_CFG" "$SANDBOX_CFG"
else
  echo "Sandbox config already links to something, leaving it as is:"
  ls -ld "$SANDBOX_CFG"
fi

echo
echo "Done."
echo
echo "From now on, $APP_ID will use:"
echo "  sandbox path  = $SANDBOX_CFG"
echo "  which points to= $HOST_CFG"
echo
echo "Next steps:"
echo "  1. Run: flatpak run $APP_ID"
echo "  2. Check BIOS, memcards, and paths - they should match ~/.config/PCSX2"
#+END_SRC

** Ungoogled Chromium Flatpak -> host (AppImage) profile bridge
Reuse the host Chromium profile at ~/.config/chromium (XDG) instead of ~/.var/app/...

#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-ungoogled-chromium-profile-bridge :tangle-mode (identity #o755) :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APP_ID="io.github.ungoogled_software.ungoogled_chromium"

# Host profile root. This is the folder that contains "Default/", "Local State", etc.
HOST_CFG_BASE="${XDG_CONFIG_HOME:-$HOME/.config}"
HOST_PROFILE="${HOST_PROFILE_DIR:-$HOST_CFG_BASE/chromium}"

SBX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SBX_PROFILE="$SBX_CFG_BASE/chromium"

if [ ! -d "$HOST_PROFILE" ]; then
  echo "Host profile dir not found: $HOST_PROFILE" >&2
  echo "Tip: confirm AppImage profile root, it should contain 'Default/' and 'Local State'." >&2
  exit 1
fi

if [ ! -d "$HOST_PROFILE/Default" ] && [ ! -f "$HOST_PROFILE/Local State" ]; then
  echo "Host profile dir exists but doesn't look like a Chromium profile root:" >&2
  echo "  $HOST_PROFILE" >&2
  echo "Expected either $HOST_PROFILE/Default/ or $HOST_PROFILE/Local State" >&2
  exit 1
fi

echo "Granting $APP_ID access to host profile:"
echo "  $HOST_PROFILE"

# Reproducible permission override: host XDG config chromium
flatpak override --user --filesystem="xdg-config/chromium:create" "$APP_ID"

# If you want cache/state on host too, uncomment:
# flatpak override --user --filesystem="xdg-cache/chromium:create" "$APP_ID"
# flatpak override --user --filesystem="xdg-state/chromium:create" "$APP_ID"

mkdir -p "$SBX_CFG_BASE"

# Resolve absolute target to reduce weirdness
HOST_PROFILE_REAL="$(readlink -f "$HOST_PROFILE")"

if [ -L "$SBX_PROFILE" ]; then
  tgt="$(readlink -f "$SBX_PROFILE" || true)"
  if [ "$tgt" = "$HOST_PROFILE_REAL" ]; then
    echo "Already linked:"
    echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
    exit 0
  fi
  echo "Different symlink exists, refusing to overwrite:" >&2
  ls -ld "$SBX_PROFILE" >&2
  exit 1
fi

if [ -e "$SBX_PROFILE" ]; then
  ts="$(date +%Y%m%d-%H%M%S)"
  backup="${SBX_PROFILE}.bak.$ts"
  echo "Existing sandbox profile found, backing up:"
  echo "  $SBX_PROFILE -> $backup"
  mv "$SBX_PROFILE" "$backup"
fi

echo "Linking sandbox profile to host profile:"
echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
ln -sT "$HOST_PROFILE_REAL" "$SBX_PROFILE"

echo
echo "Done."
echo "Next:"
echo "  1) Make sure the AppImage is not running (Chromium profiles lock)."
echo "  2) Run: flatpak run $APP_ID"
echo "  3) Visit chrome://version and confirm Profile Path."
#+END_SRC


* Moonlight DS4 right-stick deadzone
Apply a kernel-level deadzone to the hall-effect modded DS4 right stick
(axes 3=ABS_RX, 4=ABS_RY) so Moonlight does not see drift at rest.

Moonlight uses SDL2 for gamepad input. The kernel flatness alone is not
enough — SDL must also be told to honour it via
=SDL_LINUX_JOYSTICK_DEADZONES=1=. That override is applied once by
=flatpak override= (see below) and persists across launches.

#+BEGIN_SRC bash :tangle linux/.local/bin/ds4-right-deadzone :shebang "#!/usr/bin/env bash" :mkdirp yes
# ~/.local/bin/ds4-right-deadzone
#!/usr/bin/env bash
set -euo pipefail

# Hall-effect modded DS4, conservative right-stick deadzone.
# 35 covers observed drift (~10 counts RX, ~16 counts RY) with headroom.
DEADZONE="${DS4_DEADZONE:-35}"
WAIT_SECS=20

matches_target_name() {
  local name="$1"
  [[ "$name" == "Sony Interactive Entertainment Wireless Controller" ]] \
    || [[ "$name" == "Wireless Controller" ]]
}

find_controller_event() {
  local evsys name_file name dev
  for evsys in /sys/class/input/event*; do
    [[ -e "$evsys" ]] || continue
    dev="/dev/input/${evsys##*/}"
    name_file="$evsys/device/name"
    [[ -r "$name_file" ]] || continue
    name="$(<"$name_file")"
    matches_target_name "$name" || continue
    if evdev-joystick --showcal "$dev" >/dev/null 2>&1; then
      printf '%s\n' "$dev"
      return 0
    fi
  done
  return 1
}

main() {
  command -v evdev-joystick >/dev/null 2>&1 || {
    echo "Missing required command: evdev-joystick (apt install joystick)" >&2
    exit 1
  }

  local dev=""
  for ((i=0; i<WAIT_SECS; i++)); do
    if dev="$(find_controller_event)"; then
      break
    fi
    sleep 1
  done

  if [[ -z "$dev" ]]; then
    echo "DS4 controller not found after ${WAIT_SECS}s" >&2
    exit 1
  fi

  # ABS_RX = axis 3, ABS_RY = axis 4
  evdev-joystick --evdev "$dev" --axis 3 --deadzone "$DEADZONE"
  evdev-joystick --evdev "$dev" --axis 4 --deadzone "$DEADZONE"

  echo "Applied right-stick deadzone ${DEADZONE} to ${dev}"
  evdev-joystick --showcal "$dev"
}

main "$@"
#+END_SRC

** Moonlight SDL joystick deadzone override
Moonlight's Flatpak must be told to honour kernel deadzones via SDL.
This is a one-time =flatpak override= — run it once, or let =flatpak-perms-apply= handle it.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-moonlight-ds4-setup :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
set -euo pipefail

APP_ID="com.moonlight_stream.Moonlight"

echo "Enabling SDL_LINUX_JOYSTICK_DEADZONES for $APP_ID"
flatpak override --user --env=SDL_LINUX_JOYSTICK_DEADZONES=1 "$APP_ID"

echo "Done. Moonlight will now respect kernel joystick deadzones."
echo
echo "Run ds4-right-deadzone (with sudo) before launching Moonlight:"
echo "  sudo ~/.local/bin/ds4-right-deadzone"
echo "  flatpak run $APP_ID"
#+END_SRC

