linux/.local/bin/flatpak-moonlight-ds4-setup
#!/usr/bin/env bash
# Moonlight SDL joystick deadzone override
# Moonlight's Flatpak must be told to honour kernel deadzones via SDL.
# This is a one-time =flatpak override= — run it once, or let =flatpak-perms-apply= handle it.

# [[file:../../../flatpak.org::*Moonlight SDL joystick deadzone override][Moonlight SDL joystick deadzone override:1]]
#!/usr/bin/env bash
set -euo pipefail

APP_ID="com.moonlight_stream.Moonlight"

echo "Enabling SDL_LINUX_JOYSTICK_DEADZONES for $APP_ID"
flatpak override --user --env=SDL_LINUX_JOYSTICK_DEADZONES=1 "$APP_ID"

echo "Done. Moonlight will now respect kernel joystick deadzones."
echo
echo "Run ds4-right-deadzone (with sudo) before launching Moonlight:"
echo "  sudo ~/.local/bin/ds4-right-deadzone"
echo "  flatpak run $APP_ID"
# Moonlight SDL joystick deadzone override:1 ends here
